dic = {1: 'A', 2: 'B', 3: 'C', 4: 'D', 5: 'E', 6: 'F', 7: 'G', 8: 'H', 9: 'I', 10: 'J', 11: 'K', 12: 'L', 13: 'M', 14: 'N', 15: 'O', 16: 'P', 17: 'Q', 18: 'R', 19: 'S', 20: 'T', 21: 'U', 22: 'V', 23: 'W', 24: 'X', 25: 'Y', 26: 'Z'} # Словарь-алфавит

n = int(input())

if n > 0 and n < 27: # «Проверка на дурака»
    kol = 1
    for i in range(n, 0, -1):
        plus = n
        for j in range(kol):
            print(dic[plus], end=' ') # Вывод значения словаря по ключу
            plus -= 1
        print()
        kol += 1
else:
    print('Букв всего 26! Попробуйте снова')
